/*********************************** 郑州轻工业学院创新实验室*************************************************************
 *                           
 * 文件名称: direction_control 
 * 功能    : 方向控制 
 *
 * 平台    : MK60DZ512
 * 描述    : None
 *    舵机频率 125   float Steering_kp=15.0,Steering_ki=1.3,Steering_kd=0,cross_k=0.25;//太大十字会抖动
      舵机频率 100   Steering_CENTRE=1540;direction_CENTRE=1490

 * 作 者   : 2015/2/1, by xiong jin qi
***************************************************************************************************************************/
#include  "include.h"
#include  "direction_control.h"

#define centern_line  80

uint8 turn_left_flag,turn_right_flag;


/************************************************************
 * 函数名称: direction_measure() 
 * 输入参数: None    
 * 输出参数: None 
 * 
 * 功 能: 方向处理 
 * 
 * 作 者: 2015/2/1, by xiong jin qi 
 ************************************************************/
void direction_measure()
{

}
/************************************************************
 * 函数名称: Steering_control() 
 * 输入参数: None    
 * 输出参数: None 
 * 
 * 功 能: 摇头舵机控制 
 * 
 * 作 者: 2015/2/1, by xion jin qi 
 ************************************************************/
void steering_control()
{
  
}
/************************************************************
 * 函数名称: direction_control_out() 
 * 输入参数: None    
 * 输出参数: None 
 * 
 * 功 能: 转向舵机控制 
 * 
 * 作 者: 2015/2/1, by xiong jinqi 
 ************************************************************/
void direction_control_out()
{
  
}





